Revit 2027 API
ScheduleField.GetFormatOptions Method
 Gets the FormatOptions to optionally override the default settings in the Units class.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetFormatOptions()
Public Function GetFormatOptions As FormatOptions
public:
FormatOptions^ GetFormatOptions()
member GetFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
 A copy of the FormatOptions.
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace